<a href="https://colab.research.google.com/github/Vishakkrisha/ppml-230901118/blob/main/Data_Aggregation_and_Grouping.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import numpy as np
import pandas as pd
df=pd.DataFrame({'Name':['Alice','Raj','Raj','Subbu','Hari','Raj'],'Category':['A','F','U','A','A','F'],'Value':np.random.randint(1,5,size=6),'Score':np.random.randint(60,100,size=6)})
print("\n Original DataFrame: \n",df)
df1=df.groupby(('Name'),as_index=False)['Value'].sum()
print("\n Group and aggregate with one column: \n",df1)

 Original DataFrame:
     Name Category  Value  Score
0  Alice        A      4     96
1    Raj        F      3     95
2    Raj        U      3     98
3  Subbu        A      4     78
4   Hari        A      1     74
5    Raj        F      3     60

 Group and aggregate with one column:
     Name  Value
0  Alice      4
1   Hari      1
2    Raj      9
3  Subbu      4

In [7]:
df2=df.groupby(('Name'),as_index=False)[['Value','Score']].sum()
print("\n Group and aggregate with two column sum: \n",df2)

 Group and aggregate with two column sum:
     Name  Value  Score
0  Alice      4     96
1   Hari      1     74
2    Raj      9    253
3  Subbu      4     78

In [9]:
df3=df.groupby(('Name'),as_index=False)['Value'].agg('sum')
print("\n Group and aggregate with one column sum: \n",df3)

 Group and aggregate with one column sum:
     Name  Value
0  Alice      4
1   Hari      1
2    Raj      9
3  Subbu      4

In [10]:
df4=df.groupby('Name').agg({'Value':['sum','mean','min','max']})
print("\n Group by name and multiple aggregation: \n",df4)

 Group by name and multiple aggregation:
       Value
        sum mean min max
Name
Alice     4  4.0   4   4
Hari      1  1.0   1   1
Raj       9  3.0   3   3
Subbu     4  4.0   4   4

In [12]:
df5=df.groupby(('Name'),as_index=False)['Value'].count()
print("\n Group and count: \n",df5)

 Group and count:
     Name  Value
0  Alice      1
1   Hari      1
2    Raj      3
3  Subbu      1

In [13]:
df6=df.groupby(('Name')).count()
print("\n Group and count: \n",df6)

 Group and count:
        Category  Value  Score
Name
Alice         1      1      1
Hari          1      1      1
Raj           3      3      3
Subbu         1      1      1

In [14]:
df7=df.groupby(('Name'),as_index=False)['Value'].first()
print("\n Group and display from first: \n",df7)
df8=df.groupby(('Name')).first()
print("\n Group and display from first: \n",df8)

 Group and display from first:
     Name  Value
0  Alice      4
1   Hari      1
2    Raj      3
3  Subbu      4

 Group and display from first:
       Category  Value  Score
Name
Alice        A      4     96
Hari         A      1     74
Raj          F      3     95
Subbu        A      4     78

In [15]:
df9=df.groupby(('Name'),as_index=False)['Value'].last()
print("\n Group and display from last: \n",df9)
df10=df.groupby(('Name')).last()
print("\n Group and display from last: \n",df10)

 Group and display from last:
     Name  Value
0  Alice      4
1   Hari      1
2    Raj      3
3  Subbu      4

 Group and display from last:
       Category  Value  Score
Name
Alice        A      4     96
Hari         A      1     74
Raj          F      3     60
Subbu        A      4     78

In [17]:
df11=df.groupby(('Name'),as_index=False)['Value'].size()
print("\n Group and display from size: \n",df11)
df12=df.groupby(('Name')).size()
print("\n Group and display from size: \n",df12)

 Group and display from size:
     Name  size
0  Alice     1
1   Hari     1
2    Raj     3
3  Subbu     1

 Group and display from size:
 Name
Alice    1
Hari     1
Raj      3
Subbu    1
dtype: int64